//
//  PrivacyPolicyClass.swift
//  GPCamp3
//
//  Created by work on 2020/04/06.
//  Copyright © 2020 Masahiro Okura. All rights reserved.
//

import Foundation

class privacyPolicy {
    let policyText =
        "【GPCamp】プライバシーポリシー \n" +
    "OKStore（以下「当社」という）は、当社の提供するアプリケーション【GPCamp】（以下「本アプリケーション」という）の利用者（以下「ユーザー」という）に関する個人情報を含んだ情報（以下「ユーザー情報」という）の取扱いについて、以下のとおりプライバシーポリシー（以下「本ポリシー」という）を定めます。\n １．情報を取得するアプリ提供者 OK Store \n ２．取得するユーザー情報と目的 \n本アプリケーションで取得するユーザー情報と目的は以下のとおりです。\n■利用する利用者情報\n① ユーザ識別ID \n□利用者情報の利用目的 \n本サービス提供の際にお客様を識別するため  \n■利用する利用者情報\n② GPSによる位置情報 \n□利用者情報の利用目的 \n本サービスの地図情報提供のため  \n■利用する利用者情報\n③ Google Firebase利用による、以下のアプリ利用に対する基本情報 \n・ユーザー認証情報 \n・クラッシュ情報 \n・パフォーマンス分析情報 \n□利用者情報の利用目的 \n本アプリケーション品質向上のため   \n３．取得方法 当社は、情報収集モジュールを内蔵した本アプリケーションにより、ユーザー情報を自動取得します。\n  ４．通知・公表または同意取得の方法・利用者関与の方法 \n（１）通知・公表 当社は、本ポリシーに関する通知・公表は本アプリケーションに掲載する方法で行います。  \n（２）同意取得の方法\n お客様は本アプリケーションの初回起動時に、本アプリケーション・プライバシーポリシーの内容を確認し、同意を付与する機会が与えられます。\n本アプリケーションおよび本サービスは本アプリケーション・プライバシーポリシーをご確認いただき、内容を理解したうえでご利用ください。また、本アプリケーション・プライバシーポリシーは本アプリの設定画面に公開いたします。  \n（３）利用者関与の方法\n ユーザー情報の取得は、本アプリケーションをアンインストールすることで中止することができます。  \n５．外部送信・第三者提供・情報収集モジュール \n（１）外部送信\n 取得したユーザー情報については、当社が管理を委託するホスティング会社のサーバーに送信されます。  \n（２）第三者提供 当社は、取得したユーザー情報について、以下の場合第三者に提供することがあります。\n ・統計的なデータなどユーザーを識別することができない状態で提供する場合 \n・法令に基づき開示・提供を求められた場合  \n（３）情報収集モジュール 当社は、本アプリケーションに以下の情報収集モジュールを組み込みます。 \n ・FirebaseSDK：https://firebase.google.com/  \n６．お問い合わせ\n 当社のプライバシーポリシーに関する、ご意見、ご質問、苦情の申出その他ユーザー情報の取扱いに関するお問い合わせは、以下の窓口にご連絡ください。 \n OK Store：okstorenoid@gmail.com  \n７．改定\n 当社は、当社の裁量に基づいて、本ポリシーを変更します。但し、取得するユーザー情報、利用目的、第三者提供に変更が発生した場合、本アプリケーションで通知するとともに、本ポリシー変更後、本アプリケーションの初回起動時に改めてユーザーから同意を取得します。 \n 8．制定日・改定日 制定：2020年3月30日"
}
